[ScenarioTitles]
甦る記憶=Ingatan yang Pulih
学園長に相談=Konsultasi dengan Kepala Sekolah
編入生=Murid Pindahan
葵ちゃんと一緒の下校=Pulang Sekolah Bareng Aoi-chan
葵ちゃんの記憶=Ingatan Aoi-chan
海水浴の約束=Janji Pergi ke Pantai
手打ち蕎麦=Soba Buatan Tangan
グニルックと葵ちゃん=Gniluck dan Aoi-chan
グニルックの練習=Latihan Gniluck
葵ちゃんと風見鶏の寮=Aoi-chan dan Asrama Kazamidori
葵ちゃんと大浴場のお湯=Aoi-chan dan Air Pemandian Umum
葵ちゃんとクリスマスパーティー=Aoi-chan dan Pesta Natal
最後の願い=Permintaan Terakhir
恋人=Kekasih
初デート=Kencan Pertama
新年=Tahun Baru
真剣な想い=Perasaan yang serius
いよいよ明日=Akhirnya besok tiba
立夏の淫夢=Mimpi Basah Rikka
緊縛プレイ=Permainan Ikatan Kinbaku
放課後、教室で……=Sepulang Sekolah, di Ruang Kelas......
貧乳こそ世界の真理=Dada Rata Adalah Kebenaran Dunia
お医者さんごっこ=Main Dokter-dokteran
安心させて=Buatlah Aku Tenang
ふたりっきりの時間=Waktu Berdua Saja
ありえなかった過去たち=Masa lalu yang takkan pernah ada
今の俺たち=Kita yang sekarang
帰りたいけど=Ingin pulang, tapi...
鬼からの解放=Pembebasan dari Oni
葛木家と五条院家=Keluarga Katsuragi dan Keluarga Gojouin
三回目の対抗戦=Pertandingan kompetisi ketiga
なんとしても出場=Harus berpartisipasi bagaimanapun caranya
コースの下見=Survei rute lintasan
姫乃の手料理=Masakan buatan Himeno
連携の大切さ=Pentingnya kerja sama
無理しないでね=Jangan memaksakan diri, ya
リッカさんに相談=Berkonsultasi dengan Ricca-san
リッカさんと特訓=Latihan khusus dengan Ricca-san
姫乃の差し入れ=Bekal dari Himeno
代表選手決定！=Penentuan pemain perwakilan！
水上レース開催=Pembukaan balapan air
結婚しようよ=Ayo kita menikah
まるでハネムーンのように=Bagaikan bulan madu
癒しの存在=Sosok yang Menenangkan
明日が楽しみ=Menantikan Hari Esok
いつまでも一緒に=Bersama Selamanya
結ばれる季節=Musim Bersatunya Cinta
エピローグ=Epilog
すももと初エッチ=Seks Pertama dengan Sumomo
資料提供=Pemberian Materi
素敵な初エッチ=Seks Pertama yang Indah
清隆の匂い=Aroma Kiyotaka
二度目の初エッチ=Ngentot pertama untuk kedua kalinya
お礼とお返し=Terima kasih dan balasan budi
大浴場で=Di pemandian umum besar
本という名の爆弾Ａ=Bom Bernama Buku A
本という名の爆弾Ｂ=Bom Bernama Buku B
本という名の爆弾Ｃ=Bom Bernama Buku C
本という名の爆弾Ｄ=Bom Bernama Buku D
甘い吐息=Desahan Manis
少女の呼び声=Panggilan Gadis Muda
新たなる試練？=Ujian Baru？
見えない壁=Dinding yang Tak Terlihat
ロンドンに向けて=Menuju London
あたしは謎の女=Aku Adalah Wanita Misterius
修学旅行の班作り=Pembagian Kelompok Wisata Sekolah
間接イーブン=Impian Tak Langsung
あんな風になりたい=Ingin Menjadi Seperti Itu
旅行のための買い出し=Belanja untuk Perjalanan
恋を実らせる方法？=Cara Membuat Cinta Berbuah？
はるばる来たぜ倫敦=Akhirnya Sampai di London
パジャマの美琴=Mikoto dengan Piyama
迷子の迷子の美琴さん=Mikoto si Anak Hilang
コッツウォルズへ=Menuju Cotswolds
偶然の接触=Kontak yang Tak Disengaja
気にしてないから=Karena Aku Tidak Keberatan
すももの勘=Firasat Sumomo
恋の自覚=Kesadaran akan Cinta
戻らなくていい=Tidak Perlu Kembali
杉並の真意=Niat Sebenarnya dari Suginami
秘密のカップル=Pasangan Rahasia
それぞれの特別=Keistimewaan Masing-masing
遊園地デート=Kencan di Taman Hiburan
今年イチバンの特ダネ=Berita Eksklusif Terhangat Tahun Ini
プロローグ=Prolog
あれからの俺たち=Kami Sejak Saat Itu
忙し目のリッカさん=Ricca-san yang Agak Sibuk
彼女のためにできること=Hal yang Bisa Dilakukan Untuknya
移動遊園地？=Taman Hiburan Keliling？
ひょんなことから=Karena Suatu Hal
昨晩のイアン=Ian Tadi Malam
何が何でも=Bagaimanapun Caranya
終業式の朝=Pagi di Hari Penutupan Semester
明日から夏休み=Libur Musim Panas Mulai Besok
リッカのいない夏休み=Libur Musim Panas Tanpa Ricca
帰ってこないリッカ=Ricca yang Tak Kunjung Pulang
昔の記憶=Ingatan Masa Lalu
出立=Keberangkatan
噂の移動遊園地=Taman Hiburan Keliling yang Rumornya Beredar
ずぶ濡れリッカ=Ricca yang Basah Kuyup
ずぶ濡れ清隆=Kiyotaka yang Basah Kuyup
昔の思い出=Kenangan Masa Lalu
種も仕掛けもある話=Cerita di Balik Trik dan Rahasianya
一夜にして=Hanya dalam Semalam
これからもリッカさんと=Ke depannya Pun Tetap Bersama Ricca-san
悪夢の中で=Di Dalam Mimpi Buruk
命がけの任務の後に=Setelah Misi Bertaruh Nyawa
四季をよろしく=Tolong Jaga Shiki
四季とパーティー=Pesta Bareng Shiki
昨日はどうだった？=Gimana Kemarin？
おせっかい耕助=Kousuke yang Sok Ikut Campur
耕助との仲=Hubungan dengan Kousuke
四季と年越し=Tahun Baru Bareng Shiki
おせち料理=Masakan Osechi
巴のアドバイス=Nasihat Tomoe
一緒に過ごす静かな時間=Waktu Tenang yang Dihabiskan Bersama
付き合ってないの？=Nggak Pacaran, Nih？
明日から新学期=Besok Mulai Semester Baru
新学期の始まり=Awal Semester Baru
皆の反応=Reaksi Semuanya
切り裂き魔事件=Kasus Pembunuh Cabik
大切な存在=Sosok yang Berharga
事件の香り=Aroma Kasus Kejahatan
トラブル発生=Masalah Terjadi
止まってしまった恋人=Kekasih yang Terhenti
霧と耕助と四季と=Kabut, Kousuke, dan Shiki
耕助の様子=Keadaan Kousuke
それからの日々=Hari-Hari Setelah Itu
復活の四季=Kebangkitan Shiki
すももの夢=Mimpi Sumomo
自身の将来=Masa Depan Sendiri
雪村すもも=Yukimura Sumomo
萌えポイント？=Poin Moe？
意識と興味=Kesadaran dan Ketertarikan
寝不足=Kurang Tidur
消える貌=Wajah yang Menghilang
人間観察=Pengamatan Manusia
すももを尾行=Membuntuti Sumomo
大切な話=Obrolan Penting
すももの過去=Masa Lalu Sumomo
取材の申し入れ=Permohonan Wawancara
体験入部=Uji Coba Masuk Klub
非公式新聞部からの挑戦状=Surat Tantangan dari Klub berita tidak resmi
お泊まり会=Acara Menginap
宇宙人召喚の儀式=Ritual Pemanggilan Alien
前世の話=Cerita Kehidupan Sebelumnya
小説=Novel
恋人と迎える朝=Pagi Hari Bersama Kekasih
報告と驚愕と祝福=Laporan, Kekagetan, dan Berkat
すももの笑顔=Senyuman Sumomo
よみがえる想い=Kenangan yang Bangkit Kembali
状況の整理=Membereskan Situasi
公認の仲に=Menjadi Hubungan yang Diakui
ぎこちない幸せ=Kebahagiaan yang Canggung
次こそは=Lain Kali Pasti
大切なサラのために=Demi Sara yang Berharga
特訓のサポート=Dukungan Latihan Khusus
思い出のアクセサリー=Aksesori Kenangan
リッカのアドバイス=Nasihat dari Ricca
未来への布石=Langkah untuk Masa Depan
大会前日=Sehari Sebelum Turnamen
家族=Keluarga
サラの雄姿=Sosok Gagah Sara
サラをよろしく=Tolong Titip Sara
改めてプロポーズ=Melamar Sekali Lagi
夢の中の記憶=Ingatan di dalam mimpi
確かめ合うふたり=Dua orang yang saling meyakinkan
初デート再来？=Kencan pertama terulang kembali？
エトの正体=Identitas asli Eto
最初で最後のプレゼント=Hadiah pertama dan terakhir
約束=Janji
限られた時間の中で=Di dalam waktu yang terbatas
素敵なショッピング=Belanja yang menyenangkan
男同士の関係=Hubungan sesama pria
地上でお買い物=Belanja di atas tanah
特別な夜=Malam yang spesial
笑顔でありがとう=Terima kasih dengan senyuman
きっと、また会える=Pasti, kita akan bertemu lagi
